:MATCHNETSERVER
{	
	BindIP = "0.0.0.0"		// bind IP	
	Port = 12100		// Port	
	CreateWorker = 4		// 생성 워커 스레드
	ActiveWorker = 2		// 활성화 워커스레드
	CreateAccept = 1		// 생성 엑셉트 스레드
	HeadCode = 119		// 헤더 코드
	XorCode1 = 50		// XorCode 1번
	XorCode2 = 132		// XorCode 2번
	Nodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	MaxJoinUser = 17000	// 최대 접속 가능 유저 수
	LogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템	
}

:MATCHDB
{
	DBIP = "127.0.0.1"
	DBUser = "root"
	DBPassword = "034689"
	DBName = "matchmaking_status"
	DBPort = 3306
	MatchDBHeartbeat = 2000	// 매치메이킹DB에, 몇 밀리세컨드마다 하트비트를 보낼 것인가.	
	MatchDBConnectUserChange = 20	// 매치메이킹 DB에, 몇 명의 변화가 있을 때 마다 갱신할 것인가.
}

:MATCHLANCLINET
{
	MasterServerIP = "127.0.0.1"		// Master의 LanServer IP
	MasterServerPort = 13000		// Master의 LanServer Port
	ClientCreateWorker = 1		// 생성 워커 스레드
	ClientActiveWorker = 1		// 활성화 워커스레드
	ClientNodelay = 0			// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
}

:CONFIG
{
	ServerIP = "127.0.0.1"	// 현재 Net 서버의 IP. 매치메이킹 DB에 등록 용도. 실제 사용 시에는 공인 IP 등록 (106.245.38.107)
	ServerNo = 1	// 해당 매치메이킹 서버의 번호. 차후 마스터 서버에게 보내거나 매치메이킹DB에 하트비트 시 사용
	MasterToken = "abcdefghijklnmopqrstuvwxyz123456"	// 마스터 서버에 접속할 때 들고갈 인증토큰
	VerCode = 123456		// 버전 코드. 클라이언트가 들고온다.
}
